#### Time Count

In [ ]:
t_start = time()
print('done in %0.3f minutes.' % ((time() - t_start) / 60))

#### Time Related

In [10]:
date_format = "%Y-%m-%d"
from datetime import datetime
from datetime import timedelta
from datetime import date

now = str(date.today())
start = datetime.strptime(now, date_format)+timedelta(days=-2)
start.strftime(date_format)

now = datetime.now()
start = now + timedelta(days=-90)
start = start.strftime(date_format)
end = now + timedelta(days=-1)
end = end.strftime(date_format)

print(start,end)

2018-06-01 2018-08-29

#### Time Loop

In [3]:
from datetime import date
from dateutil.rrule import rrule, DAILY
a = date(2018, 8, 25)
b = date(2018, 8, 29)
for dt in rrule(DAILY, dtstart=a, until=b):
    datelist = dt.strftime('%Y-%m-%d').split('-')
    print(datelist)

['2018', '08', '25']
['2018', '08', '26']
['2018', '08', '27']
['2018', '08', '28']
['2018', '08', '29']

#### List

In [149]:
# append
stack = ['a','b']
stack.append(['e','f'])
# extend
stack.extend(['e','f'])

In [148]:
# sort
cars = ['Ford', 'BMW', 'Volvo']
cars.sort()

#### Set

In [142]:
# sort
cars = set(cars)
sorted(cars)

['BMW', 'Ford', 'Volvo']

#### DataFrame 
-  structure: https://chrisalbon.com/python/data_wrangling/pandas_data_structures/
-  drop: https://chrisalbon.com/python/data_wrangling/pandas_dropping_column_and_rows/

In [241]:
# create df, insert data from a lit
import pandas as pd
columns = ['name','year','reports']
values_by_columns = [['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],[2012, 2012, 2013, 2014, 2014], [4, 24, 31, 2, 3]]
values_by_rows = list(zip(*values_by_columns))
index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma']
df = pd.DataFrame(columns = columns)


for value in values_by_rows:
    df.loc[len(df)] = value

df.index = index

In [225]:
df

             name  year reports
Cochice     Jason  2012       4
Pima        Molly  2012      24
Santa Cruz   Tina  2013      31
Maricopa     Jake  2014       2
Yuma          Amy  2014       3

In [226]:
# iterate rows and get valeus of a,b column
for index, row in df.iterrows():
    print("index: %s, column name: %s, column year: %s" %(index, row['name'],row['year']))

index: Cochice, column name: Jason, column year: 2012
index: Pima, column name: Molly, column year: 2012
index: Santa Cruz, column name: Tina, column year: 2013
index: Maricopa, column name: Jake, column year: 2014
index: Yuma, column name: Amy, column year: 2014

In [227]:
# add new column
df['age'] = [20,31,40,31,25]

In [ ]:
# group 
df.groupby(['year'])['name'].count() # pd series 
df.groupby(['year'])['name'].count().reset_index() # data frame

In [229]:
# group + value counts
df.groupby('year')['name'].value_counts() #pd series

year  name
2012  Jason    1
      Molly    1
2013  Tina     1
2014  Amy      1
      Jake     1
Name: name, dtype: int64

In [230]:
# unstack: Unstack switches the rows to columns to get the activity counts as features.
df.groupby('year')['name'].value_counts().unstack().fillna(0)

name  Amy  Jake  Jason  Molly  Tina
year
2012  0.0   0.0    1.0    1.0   0.0
2013  0.0   0.0    0.0    0.0   1.0
2014  1.0   1.0    0.0    0.0   0.0

In [231]:
df

             name  year reports  age
Cochice     Jason  2012       4   20
Pima        Molly  2012      24   31
Santa Cruz   Tina  2013      31   40
Maricopa     Jake  2014       2   31
Yuma          Amy  2014       3   25

In [309]:
# df drop row by the index name 
df1 = df.drop(['Pima'], inplace = False) # inplace = true means we are changing the original df

In [310]:
df1

             name  year reports
Cochice     Jason  2012       4
Santa Cruz   Tina  2013      31
Maricopa     Jake  2014       2
Yuma          Amy  2014       3

In [311]:
# df drop column by column name
df1.drop('reports',axis=1, inplace = True)

In [297]:
df1

             name  year
Cochice     Jason  2012
Santa Cruz   Tina  2013
Maricopa     Jake  2014
Yuma          Amy  2014

In [312]:
# drop row if it contains a certian value
df1[df.name != 'Tina']

/usr/local/lib/python3.6/site-packages/ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

           name  year
Cochice   Jason  2012
Maricopa   Jake  2014
Yuma        Amy  2014

In [314]:
# Drop a row by row number
df1.drop(df1.index[1], inplace = True) # or drop a range df.index[[1,2]]

In [315]:
df1

          name  year
Cochice  Jason  2012
Yuma       Amy  2014

In [316]:
df

             name  year reports
Cochice     Jason  2012       4
Pima        Molly  2012      24
Santa Cruz   Tina  2013      31
Maricopa     Jake  2014       2
Yuma          Amy  2014       3

In [317]:
# df select 
df.loc[(df['name']=='Jason') & (df['year']==2012)]['reports']

Cochice    4
Name: reports, dtype: object

In [318]:
# insert a row by index
df.loc['April'] = ['Wang',2016,5]

In [322]:
df

             name  year reports
Cochice     Jason  2012       4
Pima        Molly  2012      24
Santa Cruz   Tina  2013      31
Maricopa     Jake  2014       2
Yuma          Amy  2014       3
April        Wang  2016       5

In [327]:
# select multiple rows and columns by index
df.iloc[0:2,[1,2]]
# select multiple rows and columns by name 
df.loc[['Pima','Yuma'],['name','year']]

       name  year
Pima  Molly  2012
Yuma    Amy  2014

In [326]:
# apply function
def num_missing(x):
    return sum(x.isnull())

#Applying per column:
print("Missing values per column:")
print(df.apply(num_missing, axis=0)) #axis=0 defines that function is to be applied on each column

#Applying per row:
print("\nMissing values per row:")
print(df.apply(num_missing, axis=1).head()) #axis=1 defines that function is to be applied on each row

Missing values per column:
name       0
year       0
reports    0
dtype: int64

Missing values per row:
Cochice       0
Pima          0
Santa Cruz    0
Maricopa      0
Yuma          0
dtype: int64

In [116]:
# pivot table
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                         "bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two",
                         "one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small",
                         "small", "large", "small", "small",
                         "large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7]})
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'], aggfunc=np.sum)

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

In [101]:
import numpy as np
import pandas as pd

df = pd.DataFrame(np.random.rand(10,4),columns=list('ABCD'))

for row in df.itertuples():
    print(row.A, row.Index)

0.06927066276754756 0
0.7433315967127784 1
0.2227109242961567 2
0.03113072493306268 3
0.43192793870532176 4
0.9069994416205223 5
0.3282763984071948 6
0.5552472464272361 7
0.8742569829200965 8
0.6158789362064941 9

#### Numpy

In [81]:
my_data = [1,2,3,4,5]
my_data = np.array(my_data, dtype=np.float32)

In [90]:
# sort numpy narray
np.sort(my_data)
np.sort(my_data)[::-1]

array([5., 4., 3., 2., 1.], dtype=float32)

#### Series

In [37]:
# create a series
import pandas as pd
import numpy as np
data = np.array(['a','b','c','d'])
s = pd.Series(data,index=[100,101,102,103])

In [38]:
# access data
print(s[100]) # with index lable
print(s[:3]) # with slice

a
100    a
101    b
102    c
dtype: object

In [13]:
# series iterate to get the index and value
for i, v in s.items():
    print(i,v)

100 a
101 b
102 c
103 d

In [21]:
# series to dict
s = pd.Series([1, 2, 3, 4])
s.to_dict()
{0: 1, 1: 2, 2: 3, 3: 4}

{0: 1, 1: 2, 2: 3, 3: 4}

In [ ]:
# create series from dict
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data)

In [1]:
# series to Value and Index (Arrary) to List
import pandas as pd
s= pd.Series([6,3,4,6])
print(s.values.tolist(),s.index.values.tolist())

[6, 3, 4, 6] [0, 1, 2, 3]

In [ ]:
# sort: same as pd .sort_values(ascending=True)

#### Filter Rows
-  https://stackoverflow.com/questions/15325182/how-to-filter-rows-in-pandas-by-regex

#### Format

#### Good to know

Inplace: https://stackoverflow.com/questions/45570984/pandas-is-inplace-true-considered-harmful-or-not